app/controllers/tasks_controller.rb

  def index
    @tasks = current_user.tasks.order("id")
---
SELECT "tasks".* FROM "tasks"  WHERE "tasks"."user_id" = $1  ORDER BY id  [["user_id", 1]]

  def create
    @task = Task.new(task_params)
    @task.user = current_user

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("created_at", "description", "due_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-05-26 06:23:42.727697"], ["description", "dfsdfdf"], ["due_at", "2014-05-14 08:23:00.000000"], ["updated_at", "2014-05-26 06:23:42.727697"], ["user_id", 1]]