app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    @task.user = current_user

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("created_at", "description", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-04-18 14:12:10.337223"], ["description", "Feed the pigs"], ["updated_at", "2014-04-18 14:12:10.337223"], ["user_id", 60]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = 52  [["description", "New description"], ["updated_at", "2014-04-24 11:45:36.233130"]]

  def destroy
    @task_id = @task.id
    @task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 68]]

    def set_task
      @task = current_user.tasks.find_by_id(params[:id])
---
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT 1  [["user_id", 74], ["id", 56]]